var data =
    {
      "十分老街":{
        "name": "十分老街",
        "lat": 25.0426735,
        "lng": 121.77
      },
      "台北市大安區南門市場":{
        "name": "台北市大安區南門市場",
        "lat": 25.0324442,
        "lng": 121.5205468
      },
      "台北市大直忠烈祠":{
        "name": "台北市大直忠烈祠",
        "lat": 25.0783859,
        "lng": 121.5309392
      },
      "台北市中山堂":{
        "name": "台北市中山堂",
        "lat": 25.0433147,
        "lng": 121.5074224
      },
      "台北市中正紀念堂":{
        "name": "台北市中正紀念堂",
        "lat": 25.0346167,
        "lng": 121.5195923
      },
      "台北市孔廟":{
        "name": "台北市孔廟",
        "lat": 25.0729505,
        "lng": 121.514413
      },
      "台北市自由廣場":{
        "name": "台北市自由廣場",
        "lat": 25.0361589,
        "lng": 121.5164996
      },
      "台北市西門町":{
        "name": "台北市西門町",
        "lat": 25.0439355,
        "lng": 121.503584
      },
      "台北市保安宮":{
        "name": "台北市保安宮",
        "lat": 25.0731023,
        "lng": 121.5154135
      },
      "台北市故宮博物館":{
        "name": "台北市故宮博物館",
        "lat": 25.1023554,
        "lng": 121.5484925
      },
      "台北市迪化街":{
        "name": "台北市迪化街",
        "lat": 25.0584963,
        "lng": 121.5095988
      },
      "台北市陽明山竹子湖":{
        "name": "台北市陽明山竹子湖",
        "lat": 25.169248,
        "lng": 121.539006
      },
      "台北市圓山大飯店":{
        "name": "台北市圓山大飯店",
        "lat": 25.0789224,
        "lng": 121.5265375
      },
      "台北市萬華區西昌街青草巷":{
        "name": "台北市萬華區西昌街青草巷",
        "lat": 25.0368927,
        "lng": 121.500389
      },
      "台北市龍山寺":{
        "name": "台北市龍山寺",
        "lat": 25.0371623,
        "lng": 121.4999
      },
      "台北車站":{
        "name": "台北車站",
        "lat": 25.0478142,
        "lng": 121.5169488
      },
      "基隆外木山":{
        "name": "基隆外木山",
        "lat": 25.154328,
        "lng": 121.735171
      },
      "基隆市中正公園":{
        "name": "基隆市中正公園",
        "lat": 25.1332946,
        "lng": 121.7506415
      },
      "基隆市文化中心":{
        "name": "基隆市文化中心",
        "lat": 25.131325,
        "lng": 121.7440483
      },
      "基隆市仙洞":{
        "name": "基隆市仙洞",
        "lat": 25.1452269,
        "lng": 121.74835
      },
      "基隆市正濱漁港":{
        "name": "基隆市正濱漁港",
        "lat": 25.1519518,
        "lng": 121.7660558
      },
      "基隆市和平島":{
        "name": "基隆市和平島",
        "lat": 25.1580556,
        "lng": 121.7680556
      },
      "基隆港":{
        "name": "基隆港",
        "lat": 25.1391787,
        "lng": 121.7507752
      },
      "基隆廟口":{
        "name": "基隆廟口",
        "lat": 25.1283103,
        "lng": 121.7435851
      },
      "新北市九份老街":{
        "name": "新北市九份老街",
        "lat": 25.1098694,
        "lng": 121.8451827
      },
      "新北市十分寮":{
        "name": "新北市十分寮",
        "lat": 25.044434,
        "lng": 121.77671
      },
      "新北市野柳":{
        "name": "新北市野柳",
        "lat": 25.204757,
        "lng": 121.6896171
      },
      "新北市瑞芳區南雅奇岩":{
        "name": "新北市瑞芳區南雅奇岩",
        "lat": 25.1201101,
        "lng": 121.8931215
      },
      "碧砂漁港":{
        "name": "碧砂漁港",
        "lat": 25.1471414,
        "lng": 121.786293
      },
      "Unknown1":{
        "name": "Unknown1",
        "lat": 25.207297,
        "lng": 121.5924028
      },
      "Unknown2":{
        "name": "Unknown2",
        "lat": 25.1477699,
        "lng": 121.7824463
      },
      "Unknown3":{
        "name": "Unknown3",
        "lat": 25.108822,
        "lng": 121.8432657
      },
      "Unknown4":{
        "name": "Unknown4",
        "lat": 25.1278449,
        "lng": 121.7546039
      },
      "Unknown5":{
        "name": "Unknown5",
        "lat": 25.1298356,
        "lng": 121.7431115
      },
      "Unknown6":{
        "name": "Unknown6",
        "lat": 25.1292236,
        "lng": 121.7417543
      },
      "Unknown7":{
        "name": "Unknown7",
        "lat": 25.1306363,
        "lng": 121.7447691
      },
      "Unknown8":{
        "name": "Unknown8",
        "lat": 25.1283884,
        "lng": 121.7425403
      },
      "Unknown9":{
        "name": "Unknown9",
        "lat": 25.1267544,
        "lng": 121.7416106
      },
      "Unknown10":{
        "name": "Unknown10",
        "lat": 25.0419564,
        "lng": 121.518802
      },
      "Unknown11":{
        "name": "Unknown11",
        "lat": 25.035464,
        "lng": 121.5247053
      },
      "Unknown12":{
        "name": "Unknown12",
        "lat": 25.152542,
        "lng": 121.7688907
      },
      "Unknown13":{
        "name": "Unknown13",
        "lat": 25.0335504,
        "lng": 121.5300246
      },
      "基隆市調和街":{
        "name": "基隆市調和街",
        "lat": 25.1303823,
        "lng": 121.7993461
      },
      "萬里區龜吼":{
        "name": "萬里區龜吼",
        "lat": 25.19467,
        "lng": 121.6875216
      },
      "基隆市白米甕砲台":{
        "name": "基隆市白米甕砲台",
        "lat": 25.1555564,
        "lng": 121.7430451
      },
      "Unknown14":{
        "name": "Unknown14",
        "lat": 25.0335675,
        "lng": 121.5300037
      },
      "台北忠孝復興SOGO新館":{
        "name": "台北忠孝復興SOGO新館",
        "lat": 25.0411352,
        "lng": 121.542942
      },
      "台北市101":{
        "name": "台北市101",
        "lat": 25.033976,
        "lng": 121.5645389
      },
      "Unknown15":{
        "name": "Unknown15",
        "lat": 25.1322305,
        "lng": 121.7452484
      }
    }